{
  "architectures": [
    "YOCOInternLM2ForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_yoco.YOCOConfig",
    "AutoModelForCausalLM": "modeling_yoco.YOCOInternLM2ForCausalLM",
    "AutoModel": "modeling_yoco.YOCOInternLM2ForCausalLM"
  },
  "bias": false,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "sliding_window": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "max_position_embeddings": 32768,
  "model_type": "yoco",
  "num_attention_heads": 16,
  "num_hidden_layers": 20,
  "num_self_decoder_layers": 10,
  "num_key_value_heads": 4,
  "pad_token_id": 2,
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.41.0",
  "use_cache": true,
  "vocab_size": 92544
}
